{"class_name": "Model", "config": {"name": "model_46", "layers": [{"name": "input_144", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 14], "dtype": "float32", "sparse": false, "name": "input_144"}, "inbound_nodes": []}, {"name": "noise1", "class_name": "BatchNormalization", "config": {"name": "noise1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_144", 0, 0, {}]]]}, {"name": "noise2", "class_name": "Dense", "config": {"name": "noise2", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["noise1", 0, 0, {}]]]}, {"name": "noise3", "class_name": "Dense", "config": {"name": "noise3", "trainable": true, "units": 300, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["noise2", 0, 0, {}]]]}, {"name": "input_145", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 3], "dtype": "float32", "sparse": false, "name": "input_145"}, "inbound_nodes": []}, {"name": "noise4", "class_name": "Reshape", "config": {"name": "noise4", "trainable": true, "target_shape": [100, 3]}, "inbound_nodes": [[["noise3", 0, 0, {}]]]}, {"name": "gen1", "class_name": "BatchNormalization", "config": {"name": "gen1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_145", 0, 0, {}]]]}, {"name": "noise5", "class_name": "BatchNormalization", "config": {"name": "noise5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["noise4", 0, 0, {}]]]}, {"name": "gen3", "class_name": "Concatenate", "config": {"name": "gen3", "trainable": true, "axis": -1}, "inbound_nodes": [[["gen1", 0, 0, {}], ["noise5", 0, 0, {}]]]}, {"name": "gen4", "class_name": "Reshape", "config": {"name": "gen4", "trainable": true, "target_shape": [100, 6, 1]}, "inbound_nodes": [[["gen3", 0, 0, {}]]]}, {"name": "conv2d_49", "class_name": "Conv2D", "config": {"name": "conv2d_49", "trainable": true, "filters": 3, "kernel_size": [3, 6], "strides": [1, 6], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["gen4", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_49", 0, 0, {}]]]}, {"name": "batch_normalization_74", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_74", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "reshape_74", "class_name": "Reshape", "config": {"name": "reshape_74", "trainable": true, "target_shape": [100, 3]}, "inbound_nodes": [[["batch_normalization_74", 0, 0, {}]]]}, {"name": "add_19", "class_name": "Add", "config": {"name": "add_19", "trainable": true}, "inbound_nodes": [[["reshape_74", 0, 0, {}], ["input_145", 0, 0, {}]]]}, {"name": "reshape_75", "class_name": "Reshape", "config": {"name": "reshape_75", "trainable": true, "target_shape": [100, 3, 1]}, "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"name": "reshape_76", "class_name": "Reshape", "config": {"name": "reshape_76", "trainable": true, "target_shape": [100, 3]}, "inbound_nodes": [[["reshape_75", 0, 0, {}]]]}], "input_layers": [["input_144", 0, 0], ["input_145", 0, 0]], "output_layers": [["reshape_76", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}