{"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "input_20", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 14], "dtype": "float32", "sparse": false, "name": "input_20"}, "inbound_nodes": []}, {"name": "noise1", "class_name": "BatchNormalization", "config": {"name": "noise1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "noise2", "class_name": "Dense", "config": {"name": "noise2", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["noise1", 0, 0, {}]]]}, {"name": "noise3", "class_name": "Dense", "config": {"name": "noise3", "trainable": true, "units": 300, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["noise2", 0, 0, {}]]]}, {"name": "input_21", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 3], "dtype": "float32", "sparse": false, "name": "input_21"}, "inbound_nodes": []}, {"name": "noise4", "class_name": "Reshape", "config": {"name": "noise4", "trainable": true, "target_shape": [100, 3]}, "inbound_nodes": [[["noise3", 0, 0, {}]]]}, {"name": "gen3", "class_name": "Concatenate", "config": {"name": "gen3", "trainable": true, "axis": -1}, "inbound_nodes": [[["input_21", 0, 0, {}], ["noise4", 0, 0, {}]]]}, {"name": "gen4", "class_name": "Reshape", "config": {"name": "gen4", "trainable": true, "target_shape": [100, 6, 1]}, "inbound_nodes": [[["gen3", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["gen4", 0, 0, {}]]]}, {"name": "eta", "class_name": "Conv2D", "config": {"name": "eta", "trainable": true, "filters": 1, "kernel_size": [3, 6], "strides": [1, 6], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "phi", "class_name": "Conv2D", "config": {"name": "phi", "trainable": true, "filters": 1, "kernel_size": [3, 6], "strides": [1, 6], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "dropout_20", "class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["eta", 0, 0, {}]]]}, {"name": "dropout_21", "class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["phi", 0, 0, {}]]]}, {"name": "lambda_32", "class_name": "Lambda", "config": {"name": "lambda_32", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxYAAAB8AGQAZACFAmQAZACFAmQBZgMZAFMAKQJO6QEAAACp\nACkB2gF4cgIAAAByAgAAAPofPGlweXRob24taW5wdXQtNTYtZjRhMThhZDVjZjRmPtoIPGxhbWJk\nYT4gAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_21", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}, {"name": "lambda_34", "class_name": "Lambda", "config": {"name": "lambda_34", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxYAAAB8AGQAZACFAmQAZACFAmQBZgMZAFMAKQJO6QIAAACp\nACkB2gF4cgIAAAByAgAAAPofPGlweXRob24taW5wdXQtNTYtZjRhMThhZDVjZjRmPtoIPGxhbWJk\nYT4qAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_21", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}, {"name": "pT", "class_name": "Conv2D", "config": {"name": "pT", "trainable": true, "filters": 1, "kernel_size": [3, 6], "strides": [1, 6], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "reshape_52", "class_name": "Reshape", "config": {"name": "reshape_52", "trainable": true, "target_shape": [100, 1]}, "inbound_nodes": [[["lambda_32", 0, 0, {}]]]}, {"name": "reshape_51", "class_name": "Reshape", "config": {"name": "reshape_51", "trainable": true, "target_shape": [100, 1]}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "reshape_54", "class_name": "Reshape", "config": {"name": "reshape_54", "trainable": true, "target_shape": [100, 1]}, "inbound_nodes": [[["lambda_34", 0, 0, {}]]]}, {"name": "reshape_53", "class_name": "Reshape", "config": {"name": "reshape_53", "trainable": true, "target_shape": [100, 1]}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "lambda_31", "class_name": "Lambda", "config": {"name": "lambda_31", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxYAAAB8AGQAZACFAmQAZACFAmQBZgMZAFMAKQJO6QAAAACp\nACkB2gF4cgIAAAByAgAAAPofPGlweXRob24taW5wdXQtNTYtZjRhMThhZDVjZjRmPtoIPGxhbWJk\nYT4XAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_21", 0, 0, {}]]]}, {"name": "dropout_19", "class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["pT", 0, 0, {}]]]}, {"name": "add_20", "class_name": "Add", "config": {"name": "add_20", "trainable": true}, "inbound_nodes": [[["reshape_52", 0, 0, {}], ["reshape_51", 0, 0, {}]]]}, {"name": "add_21", "class_name": "Add", "config": {"name": "add_21", "trainable": true}, "inbound_nodes": [[["reshape_54", 0, 0, {}], ["reshape_53", 0, 0, {}]]]}, {"name": "reshape_50", "class_name": "Reshape", "config": {"name": "reshape_50", "trainable": true, "target_shape": [100, 1]}, "inbound_nodes": [[["lambda_31", 0, 0, {}]]]}, {"name": "reshape_49", "class_name": "Reshape", "config": {"name": "reshape_49", "trainable": true, "target_shape": [100, 1]}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["add_21", 0, 0, {}]]]}, {"name": "add_19", "class_name": "Add", "config": {"name": "add_19", "trainable": true}, "inbound_nodes": [[["reshape_50", 0, 0, {}], ["reshape_49", 0, 0, {}]]]}, {"name": "lambda_33", "class_name": "Lambda", "config": {"name": "lambda_33", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AGQBFABTACkCTmeamZmZmZnpP6kAKQHaAXhyAQAA\nAHIBAAAA+h88aXB5dGhvbi1pbnB1dC01Ni1mNGExOGFkNWNmNGY+2gg8bGFtYmRhPiQAAADzAAAA\nAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "lambda_35", "class_name": "Lambda", "config": {"name": "lambda_35", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AGQBFABTACkCTmeamZmZmZnpP6kAKQHaAXhyAQAA\nAHIBAAAA+h88aXB5dGhvbi1pbnB1dC01Ni1mNGExOGFkNWNmNGY+2gg8bGFtYmRhPi4AAADzAAAA\nAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "concatenate_12", "class_name": "Concatenate", "config": {"name": "concatenate_12", "trainable": true, "axis": -1}, "inbound_nodes": [[["add_19", 0, 0, {}], ["lambda_33", 0, 0, {}], ["lambda_35", 0, 0, {}]]]}, {"name": "input_19", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 3], "dtype": "float32", "sparse": false, "name": "input_19"}, "inbound_nodes": []}, {"name": "reshape_55", "class_name": "Reshape", "config": {"name": "reshape_55", "trainable": true, "target_shape": [100, 3, 1]}, "inbound_nodes": [[["concatenate_12", 0, 0, {}]]]}, {"name": "reshape_48", "class_name": "Reshape", "config": {"name": "reshape_48", "trainable": true, "target_shape": [100, 3, 1]}, "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"name": "concatenate_13", "class_name": "Concatenate", "config": {"name": "concatenate_13", "trainable": true, "axis": -2}, "inbound_nodes": [[["reshape_55", 0, 0, {}], ["reshape_48", 0, 0, {}]]]}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 6, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": false, "batch_input_shape": [null, 100, 6, 1], "dtype": "float32", "filters": 10, "kernel_size": [6, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": false, "batch_input_shape": [null, 100, 6, 1], "dtype": "float32", "filters": 5, "kernel_size": [10, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": false, "batch_input_shape": [null, 100, 6, 1], "dtype": "float32", "filters": 2, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "dense_relu1", "class_name": "Dense", "config": {"name": "dense_relu1", "trainable": false, "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_relu2", "class_name": "Dense", "config": {"name": "dense_relu2", "trainable": false, "units": 40, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_relu1", 0, 0, {}]]]}, {"name": "dense_relu3", "class_name": "Dense", "config": {"name": "dense_relu3", "trainable": false, "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_relu2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": false, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_relu3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "inbound_nodes": [[["concatenate_13", 0, 0, {}]]]}], "input_layers": [["input_19", 0, 0], ["input_20", 0, 0], ["input_21", 0, 0]], "output_layers": [["model_1", 1, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}